###############################################################################################
# easy
###########
# 时间复杂度：O(n)
# 空间复杂度：O(1), 固定开销
###############################################################################################
class Solution:
    def maxNumberOfBalloons(self, text: str) -> int:
        have = {'b':0, 'a':0, 'l':0, 'o':0, 'n':0}
        for ch in text:
            if ch in have:
                have[ch] += 1
        return min([have['b'], have['a'], have['l']//2, have['o']//2, have['n']])