###############################################################################################
# insteresting
###########
# 时间复杂度：O(logn), n为最大层数
# 空间复杂度：O(1)
###############################################################################################
class Solution:
    def arrangeCoins(self, n: int) -> int:
        mi, ma = 1, 65536 # 经计算，最大的n也只能得到最高65536层
        while mi < ma:
            mid = (mi+ma+1)>>1
            if (1 + mid)*mid >> 1 <= n:
                mi = mid
            else:
                ma = mid - 1
        return mi